# Getting Started with pandas

1. Review를 위한 단계
- 방식 : chapter05 장을 보면서 이해하고 주석 달기
- 제출 방식 : 강사가 제시한 폴더에 파일명 수정해서 제출하기
- 파일명 : **step03_bookReview임동원.ipynb**

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Introduction to pandas Data Structures

### Series

In [3]:
# pd.Series 리스트를 시리즈로 만드는 함수
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# .values 데이터의 값을 표현
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
# .index 인덱스 값을 표현
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# 데이터값과 인덱스를 지정해 변수에 저장
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
# 변수의 인덱스를 표현
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
# a 인덱스에 해당하는 값
obj2['a']

-5

In [10]:
# b 인덱스에 해당하는 값에 6을 대입
obj2['d'] = 6
obj2['d']

6

In [11]:
# c a d의 값을 표현
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [12]:
# 변수인덱스 값 전체를 표현
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
# 변수의 값 중 0보다 큰 거
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
# 변수의 값에 2를 곱한 값 출력
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
# 밑이 e인 자연상수로 변환
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
# 변수 키값에 b가 있나요?
'b' in obj2

True

In [18]:
# 변수 키값에 e가 있나요?
'e' in obj2

False

In [21]:
# 데이터를 시리즈로 변환
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
# state변수의 내용을 키값으로, sdata의 내용을 밸류로 대응해 시리즈로 만드는 함수
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
# 변수의 null값인 부분을 찾아 boolean타입으로 반환해주는 함수
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
#  null이 아닌가?
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [25]:
# null인가?
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
#  밸류끼리 덧셈
obj3
obj4
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
# 변수 출력
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [30]:
# 시리즈 객체의 name 속성명을 지정
obj4.name = 'population'
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
# 시리즈 인덱스 객체의 name을 지정
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [33]:
# 변수에 인덱스 이름을 부여
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [53]:
# 사전타입을 데이터프레임 형태로 변환
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
# DataFrame은 표 같은 스프레드시트 형식의 자료구조로 여러 개의 칼럼이 있는데, 각 칼럼은 서로 다른 종류의 값을 담을 수 있다.

In [54]:
# 사전타입 출력
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [55]:
# df타입 출력
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [56]:
# df에서 상위 5개만 출력
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [62]:
# df로 만드는 과정에서 칼럼명으로 정렬
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [68]:
# 칼럼명과 인덱스명을 같이 주는 함수 (불러올 값이 없는 debt는 NaN값만이 덩그러니)
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [69]:
# df의 칼럼 이름만 출력
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [72]:
# df에서 특정 칼럼만 뽑아 출력
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [74]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [71]:
# 특정 칼럼 출력
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [44]:
# df 출력
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [76]:
# loc - df의 특절 칼럼의 '이름'으로 해당 칼럼출력
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [77]:
# 특정 칼럼에 내용을 일괄적으로 대입
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [79]:
# 특정 칼럼 값에 range를 써 연속하는 수를 대입
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [80]:
# 변수에 인덱스와 값을 지정
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [88]:

frame3.index=['one','two','three','four','five','six']
val2=pd.Series([1,3,5,7],index=['one','three','five','six'])
frame3['debt']=val2
frame3

       year   state  pop dept test  debt
one    2000    Ohio  1.5  NaN  NaN   1.0
two    2001    Ohio  1.7  NaN  NaN   NaN
three  2002    Ohio  3.6  NaN  NaN   3.0
four   2001  Nevada  2.4  NaN  NaN   NaN
five   2002  Nevada  2.9  NaN  NaN   5.0
six    2003  Nevada  3.2  NaN  NaN   7.0

In [89]:
del frame3['dept']

In [92]:
frame3.columns
frame3

       year   state  pop test  debt
one    2000    Ohio  1.5  NaN   1.0
two    2001    Ohio  1.7  NaN   NaN
three  2002    Ohio  3.6  NaN   3.0
four   2001  Nevada  2.4  NaN   NaN
five   2002  Nevada  2.9  NaN   5.0
six    2003  Nevada  3.2  NaN   7.0

In [93]:
del frame3['test']
frame3

       year   state  pop  debt
one    2000    Ohio  1.5   1.0
two    2001    Ohio  1.7   NaN
three  2002    Ohio  3.6   3.0
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9   5.0
six    2003  Nevada  3.2   7.0

In [85]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [86]:
# del을 사용하여 칼럼 삭제 가능
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [87]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [94]:
# 중첩된 사전을 이용해서 데이터 생성 가능 
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop
# 이렇게하면 바깥에있는 사전의 키 값이 칼럼. 안에있는 키는 row가 됨
# 네바다가 칼럼, 2001이 row

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [95]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [96]:
# column과 row 뒤집기
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [97]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [98]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [99]:
pd.DataFrame(pop)#, index=[2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [100]:
pd

In [101]:
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: seaborn, odo

In [105]:
# p167 교재와 다름, 
pd.DataFrame(pop, index=pd.Int64Index([2001, 2000, 2002]))

      Nevada  Ohio
2001     2.4   1.7
2000     NaN   1.5
2002     2.9   3.6

In [103]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [116]:
frame3['Ohio'][:1]

2000    1.5
Name: Ohio, dtype: float64

In [118]:
frame3['Ohio'][:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [120]:
frame3['Ohio'][:-2]

2000    1.5
Name: Ohio, dtype: float64

In [121]:
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [123]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [124]:
frame3['Nevada'][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [125]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [126]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [127]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [128]:
# values: DataFrame에 저장된 데이터를 2차원 배열로 반환
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [130]:
# DataFrame의 칼럼에 서로다른 dtype이 있다면 모든 칼럼을 수용하기 위해 그 칼럼 배열의 dtype이 선택됨
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [133]:
# 판다스의 색인객체: 각 로우와 칼럼에 대한 이름과 다른 메타데이터를 저장하는 객체
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [137]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [138]:
index[1:]

Index(['b', 'c'], dtype='object')

index[1] = 'd'  # TypeError

In [143]:
# index객체는 변경할 수 없기에 자료 구조 사이에서 안전하게 공유될 수 있다.
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [144]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [145]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [146]:
obj2.index is labels

True

In [147]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [148]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [149]:
'Ohio' in frame3.columns

True

In [151]:
2003 in frame3.index

False

In [152]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

새로운 색인에 맞도록 객체를 새로 생성하는 기능

In [153]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [154]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [157]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [172]:
ojb99=pd.Series(['a','b','c'], index=[1,2,3])
ojb99

1    a
2    b
3    c
dtype: object

In [175]:
# ffill 메소드를 이용하면 reindexing할때 누락된 값을 채워줌
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [183]:
# 재색인은 로우,컬럼 둘다 변경 가능하지만 순서만 전달하면 로우만 재색인
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [184]:
# 재색인은 로우,컬럼 둘다 변경 가능하지만 순서만 전달하면 로우만 재색인
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [185]:
# 열은 COLUMNS을 사용해서 재색인 가능
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [187]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [188]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [189]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [191]:
# 로우와 칼럼 모두 삭제 가능
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [192]:
# 로우 삭제
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [201]:
# 원본은 유지
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [205]:
# 컬럼을 삭제하기위해선 컬럼명과 axis=1도 넣어줘야함!
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [206]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [207]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [208]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [209]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [222]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [223]:
# 시리즈는 색인이 정수가 아니어도 됨
obj['b']

1.0

In [224]:
obj[1]

1.0

In [225]:
# 시리즈는 색인이 정수가 아니어도 됨 
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [226]:
# 시리즈는 색인이 정수가 아니어도 됨
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [227]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [217]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [218]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [219]:
# 라벨이름으로 슬라이싱하는 것은 시작점과 끝점을 포함함. 파이썬슬리이싱과 다른점.
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [228]:
# 슬라이싱문법으로 선택된 영역에 대입
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [229]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [230]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [231]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [234]:
# 슬라이싱으로 로우 선택
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

TypeError: 'DataFrame' object is not callable

In [241]:
# 불리언 배열로 로우 선택
data[data['three'] > 3] #three칼럼이 3보다 큰 로우

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [242]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [245]:
data[data < 5] = 0 # 5보다 작은값. 즉 true 값에 0 대입

In [246]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [259]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [266]:
# loc는 문자로 위치 찾고 출력
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [267]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [274]:
# iloc는 숫자로 위치 찾고 출력
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [275]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [276]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [277]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [278]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [291]:
#전체 로우에서. 3번째 컬럼까지. three컬럼의 값이 6보다 큰것만 출력
data.iloc[:, :3][data.three > 6]

          one  two  three
Utah        8    9     10
New York   12   13     14

### Integer Indexes

ser = pd.Series(np.arange(3.))
ser
ser[-1]

In [ ]:
다른 객체간의 산술 연산

In [294]:
ser = pd.Series(np.arange(3.))

In [295]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [296]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [298]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [300]:
ser99=pd.Series(np.arange(5.), index=['a','b','c','d','e'])
ser99

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [301]:
ser2[-1]

2.0

In [302]:
ser[:1]

0    0.0
dtype: float64

In [303]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [304]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [305]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [306]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [307]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [308]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [335]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [332]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [333]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [337]:
#객체를 더할 때 짝이 맞지 않는 색인이 있다면 결과에 두 색인이 통합된다.
#서로 겹치는 색인이 없다면 데이터는 NA값이 된다
#dataframe에 있는 색인과 컬럼이 합쳐진다.
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [338]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [339]:
df1

   A
0  1
1  2

In [340]:
df2

   B
0  3
1  4

In [341]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [345]:
# fill_value
# 서로 다른 색인을 가지는 객체 간의 산술연산에서 존재하지 않는 축의 값을 특수한 값으로 지정
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [346]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [347]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [348]:
df2.loc[1, 'b'] = np.nan

In [349]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [350]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [351]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [352]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [353]:
# 서로 다른 색인을 가지는 객체 간의 산술연산에서 존재하지 않는 축의 값을 특수한 값으로 지정
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [354]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [355]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [364]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [365]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [360]:
df1.reindex(columns=df2.columns, fill_value=0) #df1을 리인덱싱. df1를 df2의 열에 맞춰 리인덱싱하고 빈값을 채워넣음.

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [363]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

#### Operations between DataFrame and Series

In [367]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [368]:
arr[0]

array([0., 1., 2., 3.])

In [369]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [373]:
test=pd.DataFrame(np.arange(6).reshape(3,2), columns=['a','b'], index=['하나','둘','셋'])
test

    a  b
하나  0  1
둘   2  3
셋   4  5

In [370]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [377]:
series = frame.iloc[0]

In [378]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [379]:
frame - series # DataFrame과 Series간 연산-> series의 인덱스를 DataFrame의 인덱스에 맞춤.

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [380]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [381]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [382]:
series2

b    0
e    1
f    2
dtype: int64

In [384]:
# 색인 값을 DataFrame의 컬럼이나 Series의 색인에서 찾을 수 없다면 그 객체는 형식을 맞추기위해 재색인
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [385]:
series3 = frame['d']

In [386]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [387]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [388]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [390]:
frame.sub(series3, axis=0) # axis=0 :DataFrame의 로우를 따라 연산을 수행하라

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [391]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.846364 -0.040189  0.968076
Ohio    0.439689  0.447379  1.496335
Texas  -0.506170  1.265416 -0.101522
Oregon -0.074434  0.741836 -1.294954

In [392]:
np.abs(frame)

               b         d         e
Utah    0.846364  0.040189  0.968076
Ohio    0.439689  0.447379  1.496335
Texas   0.506170  1.265416  0.101522
Oregon  0.074434  0.741836  1.294954

In [394]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.352534
d    1.305606
e    2.791289
dtype: float64

In [397]:
a = lambda x: x.max() - x.min()
frame.apply(a)

b    1.352534
d    1.305606
e    2.791289
dtype: float64

In [400]:
frame.apply(f, axis='columns')

Utah      1.008266
Ohio      1.056646
Texas     1.771586
Oregon    2.036790
dtype: float64

In [401]:
frame.apply(f, axis=1)

Utah      1.008266
Ohio      1.056646
Texas     1.771586
Oregon    2.036790
dtype: float64

In [405]:
frame

               b         d         e
Utah    0.846364 -0.040189  0.968076
Ohio    0.439689  0.447379  1.496335
Texas  -0.506170  1.265416 -0.101522
Oregon -0.074434  0.741836 -1.294954

pandas.core.series.Series

In [403]:
# apply 메소드에 전달된 함수는 스칼라 값을 반환할 필요가 없으며, series 또는 여러값을 반환해도 된다.
# 시리즈로 각 열의 최소갑과 최대값을 구하는 사용자정의함수
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.506170 -0.040189 -1.294954
max  0.846364  1.265416  1.496335

In [410]:
# 소수 두번째 자리까지만 출력되게하는 람다식 format 정의
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.85  -0.04   0.97
Ohio     0.44   0.45   1.50
Texas   -0.51   1.27  -0.10
Oregon  -0.07   0.74  -1.29

In [411]:
frame['e'].map(format) # e열에서만 출력

Utah       0.97
Ohio       1.50
Texas     -0.10
Oregon    -1.29
Name: e, dtype: object

### Sorting and Ranking

In [ ]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [ ]:
obj

In [ ]:
obj.sort_index()

In [ ]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [ ]:
frame

In [ ]:
frame.sort_index()

In [ ]:
frame.sort_index(axis=1)

In [ ]:
frame

In [ ]:
frame.sort_index(axis=1, ascending=False)

In [ ]:
obj = pd.Series([4, 7, -3, 2])

In [ ]:
obj

In [ ]:
obj.sort_values()

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

In [ ]:
obj.sort_values()

In [ ]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [ ]:
frame

In [ ]:
frame.sort_values(by='b')

In [ ]:
frame.sort_values(by=['a', 'b'])

In [ ]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

In [ ]:
obj.rank()

In [ ]:
obj.rank(method='first')

In [ ]:
obj.rank(ascending=False, method='max')

In [ ]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

In [ ]:
frame.rank(axis=1)

In [ ]:
frame.rank('columns')

### Axis Indexes with Duplicate Labels

In [ ]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
#obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

In [ ]:
obj.index.is_unique

In [ ]:
obj['a']

In [ ]:
obj['c']

In [ ]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

In [ ]:
df.loc['b']

## Summarizing and Computing Descriptive Statistics

In [ ]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

In [ ]:
df.sum()

In [ ]:
df.sum(axis='columns')

In [ ]:
df.mean(axis='columns', skipna=False)

In [ ]:
df.mean(axis='columns', skipna=True)

In [ ]:
df.idxmax()

In [ ]:
df

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

In [ ]:
obj.describe()

### Unique Values, Value Counts, and Membership

In [ ]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

In [ ]:
uniques = obj.unique()
uniques

In [ ]:
obj.value_counts()

In [ ]:
obj

In [ ]:
obj

In [ ]:
mask = obj.isin(['b', 'c'])
mask

In [ ]:
obj[mask]

In [ ]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [ ]:
to_match

In [ ]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [ ]:
unique_vals

In [ ]:
pd.Index(unique_vals).get_indexer(to_match)

In [ ]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

In [ ]:
result = data.apply(pd.value_counts).fillna(0)
result

## 누락된 데이터 처리하기

1. 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 빈번한 작업
- 모든 기술 통계는 누락된 데이터를 배제하고 처리
- 처리 방법 1 : 수집된 데이터를 직접 제거
- 처리 방법 2 : dropna 함수 사용하여 처리

In [ ]:
from numpy import nan as NA

Series의 NA값 제거해 보기

In [ ]:
data = Series([1, NA, 3.5, NA, 7])

In [ ]:
data

In [ ]:
data.dropna()

In [ ]:
data

In [ ]:
data[data.notnull()]

DataFrame의 NA값 제거하기

In [ ]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

In [ ]:
cleaned = data.dropna()
cleaned

In [ ]:
data

In [ ]:
data.dropna(how='all')

In [ ]:
data

In [ ]:
data[4] = NA
data

In [ ]:
df = DataFrame(np.random.randn(7, 3))

In [ ]:
df

In [ ]:
df.loc[:4, 1] = NA

In [ ]:
df

In [ ]:
df.loc[:2, 2] = NA
df

In [ ]:
df.dropna(thresh=3)

In [ ]:
df

In [ ]:
df.dropna(thresh=2, axis=0)

In [ ]:
df

In [ ]:
df.dropna(thresh=5, axis=1)

In [ ]:
df.dropna(thresh=3, axis=1)

누락된 값 채우기

In [ ]:
df

In [ ]:
df.fillna(0)

In [ ]:
df

In [ ]:
df.fillna({1:0.5, 3:-1})

In [ ]:
df

In [ ]:
df.fillna({2:10})

In [ ]:
df

## 계층적 색인

1. pandas의 중요한 기능
- 축에 대해 다중(2개 이상) 색인 단계 지정 가능(MultiIndex)
- 고차원 데이터를 낮은 차원의 형식으로 다룰수 있게 해주는 기능

In [ ]:
data = Series(np.random.randn(10), 
              index=[
                      ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                      [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
              ])

In [ ]:
data

In [ ]:
data.index

In [ ]:
data.values

계층적으로 색인된 객체는 데이터의 부분 집합을 부분적 색인으로 접근이 가능

In [ ]:
data['b']

In [ ]:
data['b':'c']

In [ ]:
data.loc[['b', 'c']]

In [ ]:
data

하위 계층의 객체 선택

In [ ]:
data[:, 2]

계층적인 색인은 데이터를 재형성 가능

In [ ]:
data.unstack()

In [ ]:
data

In [ ]:
data.unstack().stack()

In [ ]:
frame = DataFrame(np.arange(12).reshape(4,3), 
                  index=[['a','a','b','b'], [1, 2, 1, 2]], 
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [ ]:
frame

In [ ]:
frame.index

In [ ]:
frame.index.names

In [ ]:
frame.index.names = ['key1', 'key2']

In [ ]:
frame.index.name

In [ ]:
frame.index

In [ ]:
frame.columns

In [ ]:
frame.columns.names = ['state', 'color']

In [ ]:
frame

In [ ]:
frame['Ohio']

계층 순서 바꾸고 정렬하기

In [ ]:
frame

In [ ]:
frame.swaplevel('key1', 'key2')

In [ ]:
frame

In [ ]:
frame.sort_index(1)

단계별 요약통계
> level 옵션 : 한축에 대해 합을 구하고 싶은 단계 지정할 수 있는 옵션

In [ ]:
frame

In [ ]:
frame.sum()

In [ ]:
frame.sum(level='key2')

DataFrame의 컬럼 사용하기

In [ ]:
frame = DataFrame({'a':range(7), 'b':range(7, 0, -1), 
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                   'd' : [0, 1, 2, 0, 1, 2, 3]})

In [ ]:
frame

In [ ]:
# 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame 생성
frame2 = frame.set_index(['c', 'd'])
frame2

In [ ]:
frame

In [ ]:
# 명시적으로 컬럼 남겨두기
frame.set_index(['c', 'd'], drop=False)

In [ ]:
frame2

In [ ]:
#계층적 색인 단계를 칼럼으로 이동
frame2.reset_index()